---
kind: enumMember
id: F:Autodesk.Revit.DB.ReferenceBaseOnHostType.PrimaryEnd
enum: Autodesk.Revit.DB.ReferenceBaseOnHostType
source: html/13a3d927-757f-651a-0729-cf0307759851.htm
---
# Autodesk.Revit.DB.ReferenceBaseOnHostType.PrimaryEnd